tutorialsDyM/2DBulldozer_partial/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(

    ( -2.00  0.0  0)
    ( 1.00  0.0  0)
    ( 1.00  0.5  0)
    ( -2.00  0.5  0)
    ( -2.00  0.0  1)
    ( 1.00  0.0  1)
    ( 1.00  0.5  1)
    ( -2.00  0.5  1)

    ( 0.75  0.  0)
    ( 0.95  0.  0)
    ( 0.95  0.4  0)
    ( 0.75  0.4  0)
    ( 0.75  0.  1)
    ( 0.95  0.  1)
    ( 0.95  0.4  1)
    ( 0.75  0.4  1)

  //  ( 1  0.  0)
  //  ( 1.2  0.  0)
  //  ( 1.2  0.4  0)
  //  ( 1  0.4  0)
  //  ( 1  0.  1)
  //  ( 1.2 0.  1)
//    ( 1.2  0.4  1)
//    ( 1  0.4  1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (600 100 1) simpleGrading (1 1 1)

    hex (8 9 10 11 12 13 14 15) movingZone (40 80 1) simpleGrading (1 1 1)
);

edges
(
);



  boundary
  (
      overset
      {
          type        overset;
          faces
          (
              ( 8 12 15 11)
              (10 14 13  9)
              (11 15 14 10)
              ( 9 13 12  8)
          );
      }


      // Populated by subsetMesh
      hole
      {
          type wall;
          faces ();
      }


      outlet
      {
  		        type wall;

          faces
          (
              (1 2 6 5)
          );
      }

      inlet
      {
  		        type wall;
               faces
          (
              (3 0 4 7)
          );
      }

      top
      {
          type wall;
          faces
          (
              (3 7 6 2)
          );
      }
      bottom
      {
          type wall;
          faces
          (
              (0 1 5 4)
          );
      }

      frontAndBack
      {
          type empty;
          faces
          (
              (0 3 2 1)
              (4 5 6 7)
              ( 8 11 10  9)
              (12 13 14 15)
          );
      }
  );

// ************************************************************************* //
