tutorialsDyM/2DBulldozer_partial/0_org/Theta
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Theta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-6;

boundaryField
{
  "overset.*"
  {
      type            overset;
  }
  hole
  {
      type            zeroGradient;
  }
  top
  {
      type            zeroGradient;

  }
  bottom
  {
      type            zeroGradient;
  }
  inlet
  {
      type            zeroGradient;
  }
  outlet
  {
      type            zeroGradient;
  }
  inandouthalf22
  {
      type            zeroGradient;
  }

  walls
  {
      type            zeroGradient;
  }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
