tutorialsDyM/2DBulldozer_partial/0_org/alphaPlastic
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphaPlastic;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 0.55;

boundaryField
{
  inlet
  {
      type            zeroGradient;
  }
  outlet
  {
      type            zeroGradient;
  }

  hole
  {
type		zeroGradient;
  }
  "overset.*"
  {
type		overset;
  }
  top
  {
      type            zeroGradient;

  }
  bottom
  {
      type            zeroGradient;
  }
  walls
  {
      type            zeroGradient;
  }
  frontAndBack
  {
      type            empty;
  }
}


// ************************************************************************* //
