tutorialsDyM/2DBulldozer_partial/0_org/delta
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      delta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 0.0;

boundaryField
{
  hole
  {
      type            zeroGradient;
  }
  "overset.*"
  {
     type            overset;
  }

  top
  {
      type            zeroGradient;

  }
  bottom
  {
      type            zeroGradient;
  }
  inlet
  {
      type            zeroGradient;
  }
  outlet
  {
      type            zeroGradient;
  }
  walls
  {
      type            zeroGradient;
  }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
