tutorialsDyM/2DBulldozer_partial/0_org/pa
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  #includeEtc "caseDicts/setConstraintTypes"

  "(walls|hole)"
  {
      type            zeroGradient;
  }

  top
  {
      type            zeroGradient;

  }
  bottom
  {
      type            zeroGradient;
  }
  inlet
  {
      type            zeroGradient;
  }
  outlet
  {
      type            zeroGradient;
  }

  overset
  {
      type            overset;
  }
  frontAndBack
  {
      type            empty;
  }
}

// ************************************************************************* //
