tutorialsDyM/2DBulldozer_partial/0_org/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  ".*"
  {
      type            uniformFixedValue;
      uniformValue    (0 0 0);
  }
  top
  {
      type            zeroGradient;

  }
  bottom
  {
      type            zeroGradient;
  }
  inlet
  {
      type            zeroGradient;
  }
  outlet
  {
      type            zeroGradient;
  }
  overset
  {
      patchType       overset;
      type            zeroGradient;
  }

  hole
  {
      type            zeroGradient;
  }
}

// ************************************************************************* //
